raw_data/gp2-encrypted-1000Gi-800G.log
Working dir: /data

Testing Read IOPS...
read_iops: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.20
Starting 1 process
read_iops: Laying out IO file (1 file / 819200MiB)

read_iops: (groupid=0, jobs=1): err= 0: pid=10: Sat Nov 14 00:53:35 2020
  read: IOPS=2997, BW=11.7MiB/s (12.3MB/s)(176MiB/15016msec)
   bw (  KiB/s): min=11760, max=12184, per=100.00%, avg=12015.10, stdev=69.74, samples=29
   iops        : min= 2940, max= 3046, avg=3003.72, stdev=17.43, samples=29
  cpu          : usr=0.70%, sys=2.02%, ctx=12862, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=45016,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=176MiB (185MB), run=15016-15016msec

Disk stats (read/write):
  nvme2n1: ios=53754/2, merge=0/1, ticks=534504/20, in_queue=520508, util=99.50%


Testing Write IOPS...
write_iops: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.20
Starting 1 process

write_iops: (groupid=0, jobs=1): err= 0: pid=20: Sat Nov 14 00:53:54 2020
  write: IOPS=2998, BW=11.7MiB/s (12.3MB/s)(176MiB/15013msec); 0 zone resets
   bw (  KiB/s): min=11904, max=12208, per=100.00%, avg=12014.31, stdev=56.38, samples=29
   iops        : min= 2976, max= 3052, avg=3003.55, stdev=14.09, samples=29
  cpu          : usr=0.87%, sys=2.21%, ctx=12656, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,45009,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=176MiB (185MB), run=15013-15013msec

Disk stats (read/write):
  nvme2n1: ios=0/53629, merge=0/3, ticks=0/534152, in_queue=519608, util=99.51%


Testing Read Bandwidth...
read_bw: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
fio-3.20
Starting 1 process

read_bw: (groupid=0, jobs=1): err= 0: pid=30: Sat Nov 14 00:54:12 2020
  read: IOPS=1855, BW=232MiB/s (244MB/s)(3517MiB/15132msec)
   bw (  KiB/s): min=84736, max=259840, per=100.00%, avg=239385.60, stdev=51793.80, samples=30
   iops        : min=  662, max= 2030, avg=1870.20, stdev=404.64, samples=30
  cpu          : usr=0.56%, sys=2.50%, ctx=7847, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=28076,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=232MiB/s (244MB/s), 232MiB/s-232MiB/s (244MB/s-244MB/s), io=3517MiB (3688MB), run=15132-15132msec

Disk stats (read/write):
  nvme2n1: ios=33955/2, merge=0/1, ticks=537712/28, in_queue=522472, util=99.55%


Testing Write Bandwidth...
write_bw: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
fio-3.20
Starting 1 process

write_bw: (groupid=0, jobs=1): err= 0: pid=40: Sat Nov 14 00:54:31 2020
  write: IOPS=661, BW=83.2MiB/s (87.2MB/s)(1257MiB/15114msec); 0 zone resets
   bw (  KiB/s): min=79104, max=89165, per=99.82%, avg=85028.70, stdev=2095.50, samples=30
   iops        : min=  618, max=  696, avg=664.27, stdev=16.33, samples=30
  cpu          : usr=0.43%, sys=1.40%, ctx=2797, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,9995,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=83.2MiB/s (87.2MB/s), 83.2MiB/s-83.2MiB/s (87.2MB/s-87.2MB/s), io=1257MiB (1318MB), run=15114-15114msec

Disk stats (read/write):
  nvme2n1: ios=0/12207, merge=0/3, ticks=0/547652, in_queue=531760, util=99.51%


Testing Read Latency...
read_latency: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.20
Starting 1 process

read_latency: (groupid=0, jobs=1): err= 0: pid=50: Sat Nov 14 00:54:50 2020
  read: IOPS=3000, BW=11.7MiB/s (12.3MB/s)(176MiB/15002msec)
    slat (usec): min=2, max=3556, avg= 7.73, stdev=35.22
    clat (usec): min=25, max=28743, avg=1323.22, stdev=974.56
     lat (usec): min=400, max=28748, avg=1331.13, stdev=974.73
    clat percentiles (usec):
     |  1.00th=[  537],  5.00th=[  578], 10.00th=[  611], 20.00th=[  725],
     | 30.00th=[  938], 40.00th=[ 1074], 50.00th=[ 1237], 60.00th=[ 1303],
     | 70.00th=[ 1352], 80.00th=[ 1450], 90.00th=[ 1975], 95.00th=[ 2737],
     | 99.00th=[ 5407], 99.50th=[ 7111], 99.90th=[11338], 99.95th=[13566],
     | 99.99th=[17433]
   bw (  KiB/s): min=11920, max=12104, per=100.00%, avg=12017.66, stdev=43.89, samples=29
   iops        : min= 2980, max= 3026, avg=3004.41, stdev=10.97, samples=29
  lat (usec)   : 50=0.01%, 250=0.01%, 500=0.09%, 750=21.11%, 1000=13.23%
  lat (msec)   : 2=55.92%, 4=7.68%, 10=1.83%, 20=0.14%, 50=0.01%
  cpu          : usr=1.26%, sys=3.07%, ctx=42350, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=45013,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=176MiB (184MB), run=15002-15002msec

Disk stats (read/write):
  nvme2n1: ios=53638/2, merge=0/1, ticks=66204/0, in_queue=50068, util=98.70%


Testing Write Latency...
write_latency: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.20
Starting 1 process

write_latency: (groupid=0, jobs=1): err= 0: pid=60: Sat Nov 14 00:55:08 2020
  write: IOPS=3011, BW=11.8MiB/s (12.3MB/s)(177MiB/15001msec); 0 zone resets
    slat (usec): min=2, max=6116, avg= 8.52, stdev=34.78
    clat (usec): min=30, max=20437, avg=1317.39, stdev=617.20
     lat (usec): min=653, max=20444, avg=1326.07, stdev=617.44
    clat percentiles (usec):
     |  1.00th=[  701],  5.00th=[  791], 10.00th=[  873], 20.00th=[ 1020],
     | 30.00th=[ 1139], 40.00th=[ 1221], 50.00th=[ 1270], 60.00th=[ 1336],
     | 70.00th=[ 1385], 80.00th=[ 1467], 90.00th=[ 1582], 95.00th=[ 1729],
     | 99.00th=[ 4178], 99.50th=[ 5407], 99.90th=[ 8356], 99.95th=[ 9503],
     | 99.99th=[12387]
   bw (  KiB/s): min=11568, max=15768, per=100.00%, avg=12143.90, stdev=706.83, samples=29
   iops        : min= 2892, max= 3942, avg=3035.97, stdev=176.71, samples=29
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 750=3.26%, 1000=14.93%
  lat (msec)   : 2=79.02%, 4=1.69%, 10=1.05%, 20=0.04%, 50=0.01%
  cpu          : usr=1.47%, sys=3.25%, ctx=42618, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,45182,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=11.8MiB/s (12.3MB/s), 11.8MiB/s-11.8MiB/s (12.3MB/s-12.3MB/s), io=177MiB (185MB), run=15001-15001msec

Disk stats (read/write):
  nvme2n1: ios=0/53455, merge=0/3, ticks=0/65820, in_queue=50196, util=98.80%


Testing Read Sequential Speed...
read_seq: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.20
Starting 4 threads
read_seq: Laying out IO file (1 file / 820700MiB)

read_seq: (groupid=0, jobs=1): err= 0: pid=70: Sat Nov 14 03:40:47 2020
  read: IOPS=21, BW=22.3MiB/s (23.4MB/s)(381MiB/17051msec)
   bw (  KiB/s): min= 8175, max=135168, per=21.55%, avg=22029.47, stdev=20957.65, samples=34
   iops        : min=    7, max=  132, avg=21.32, stdev=20.55, samples=34
  cpu          : usr=0.04%, sys=0.19%, ctx=492, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=366,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=71: Sat Nov 14 03:40:47 2020
  read: IOPS=25, BW=25.9MiB/s (27.2MB/s)(445MiB/17175msec)
   bw (  KiB/s): min= 4087, max=188416, per=25.19%, avg=25745.62, stdev=30243.13, samples=34
   iops        : min=    3, max=  184, avg=25.00, stdev=29.57, samples=34
  cpu          : usr=0.00%, sys=0.27%, ctx=539, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=430,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=72: Sat Nov 14 03:40:47 2020
  read: IOPS=27, BW=28.1MiB/s (29.4MB/s)(445MiB/15862msec)
   bw (  KiB/s): min=12263, max=165888, per=27.46%, avg=28064.39, stdev=27135.92, samples=31
   iops        : min=   11, max=  162, avg=27.16, stdev=26.56, samples=31
  cpu          : usr=0.02%, sys=0.27%, ctx=534, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=430,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=73: Sat Nov 14 03:40:47 2020
  read: IOPS=25, BW=25.9MiB/s (27.1MB/s)(445MiB/17193msec)
   bw (  KiB/s): min=10219, max=147456, per=25.10%, avg=25649.29, stdev=23265.56, samples=34
   iops        : min=    9, max=  144, avg=24.79, stdev=22.78, samples=34
  cpu          : usr=0.00%, sys=0.27%, ctx=541, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=430,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=99.8MiB/s (105MB/s), 22.3MiB/s-28.1MiB/s (23.4MB/s-29.4MB/s), io=1716MiB (1799MB), run=15862-17193msec

Disk stats (read/write):
  nvme2n1: ios=6809/4, merge=0/1, ticks=891328/448, in_queue=880636, util=83.25%


Testing Write Sequential Speed...
write_seq: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.20
Starting 4 threads

write_seq: (groupid=0, jobs=1): err= 0: pid=83: Sat Nov 14 03:41:07 2020
  write: IOPS=19, BW=20.6MiB/s (21.6MB/s)(326MiB/15830msec); 0 zone resets
   bw (  KiB/s): min=12288, max=40960, per=23.27%, avg=20405.29, stdev=6736.83, samples=31
   iops        : min=   12, max=   40, avg=19.74, stdev= 6.54, samples=31
  cpu          : usr=0.09%, sys=0.27%, ctx=547, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,311,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=84: Sat Nov 14 03:41:07 2020
  write: IOPS=21, BW=22.1MiB/s (23.1MB/s)(345MiB/15636msec); 0 zone resets
   bw (  KiB/s): min=12288, max=38912, per=24.86%, avg=21793.61, stdev=6681.23, samples=31
   iops        : min=   12, max=   38, avg=21.10, stdev= 6.59, samples=31
  cpu          : usr=0.12%, sys=0.28%, ctx=570, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,330,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=85: Sat Nov 14 03:41:07 2020
  write: IOPS=21, BW=22.2MiB/s (23.3MB/s)(373MiB/16784msec); 0 zone resets
   bw (  KiB/s): min=12288, max=43008, per=24.77%, avg=21713.73, stdev=7561.91, samples=33
   iops        : min=   12, max=   42, avg=21.06, stdev= 7.45, samples=33
  cpu          : usr=0.05%, sys=0.35%, ctx=619, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,358,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=86: Sat Nov 14 03:41:07 2020
  write: IOPS=22, BW=23.6MiB/s (24.8MB/s)(393MiB/16649msec); 0 zone resets
   bw (  KiB/s): min=10240, max=42751, per=26.74%, avg=23442.27, stdev=8758.85, samples=33
   iops        : min=   10, max=   41, avg=22.70, stdev= 8.50, samples=33
  cpu          : usr=0.11%, sys=0.32%, ctx=618, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.3%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,378,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=85.6MiB/s (89.8MB/s), 20.6MiB/s-23.6MiB/s (21.6MB/s-24.8MB/s), io=1437MiB (1507MB), run=15636-16784msec

Disk stats (read/write):
  nvme2n1: ios=0/6812, merge=0/3, ticks=0/1008696, in_queue=995600, util=99.55%


Testing Read/Write Mixed...
rw_mix: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.20
Starting 1 process

rw_mix: (groupid=0, jobs=1): err= 0: pid=96: Sat Nov 14 03:41:26 2020
  read: IOPS=2246, BW=8999KiB/s (9215kB/s)(132MiB/15018msec)
   bw (  KiB/s): min= 8696, max= 9304, per=100.00%, avg=9004.79, stdev=138.86, samples=29
   iops        : min= 2174, max= 2326, avg=2251.17, stdev=34.72, samples=29
  write: IOPS=751, BW=3009KiB/s (3082kB/s)(44.1MiB/15018msec); 0 zone resets
   bw (  KiB/s): min= 2808, max= 3304, per=100.00%, avg=3010.31, stdev=129.41, samples=29
   iops        : min=  702, max=  826, avg=752.55, stdev=32.37, samples=29
  cpu          : usr=0.83%, sys=2.50%, ctx=12638, majf=0, minf=58
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=33737,11286,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=8999KiB/s (9215kB/s), 8999KiB/s-8999KiB/s (9215kB/s-9215kB/s), io=132MiB (138MB), run=15018-15018msec
  WRITE: bw=3009KiB/s (3082kB/s), 3009KiB/s-3009KiB/s (3082kB/s-3082kB/s), io=44.1MiB (46.3MB), run=15018-15018msec

Disk stats (read/write):
  nvme2n1: ios=40177/13458, merge=0/4, ticks=399848/132828, in_queue=518512, util=99.48%


All tests complete.

### Dbench Summary BEGIN ###
Random Read/Write IOPS: 2997/2998. BW: 232MiB/s / 83.2MiB/s
Average Latency (usec) Read/Write: 1331.13/1326.07
Sequential Read/Write: 99.8MiB/s / 85.6MiB/s
Mixed Random Read/Write IOPS: 2246/751
### Dbench Summary END ###